//package com.mymuslem.sarrawi.db
//
//import com.mymuslem.sarrawi.db.Dao.ZekerTypesDao
//import com.mymuslem.sarrawi.models.ZekerTypes
//import kotlinx.coroutines.Dispatchers
//import kotlinx.coroutines.withContext
//
//suspend fun rePopulateDb(database: AzkarDB?) {
//    database?.let { db ->
//        withContext(Dispatchers.IO) {
//            val zekerTypesDao: ZekerTypesDao = db.getTypesDao()
//            zekerTypesDao.insert_zekerTypes(ZekerTypes(1, "أَذْكَارُ الاسْـتِيقَاظِ مِنَ النَّـومِ", 0, "أذكار الاستيقاظ من النوم"))
//
//        }
//    }/*
//    ('1', 'أَذْكَارُ الاسْـتِيقَاظِ مِنَ النَّـومِ', '0', 'أذكار الاستيقاظ من النوم');
//             ('2', 'دُعَـاءُ لُبْسِ الثَّـــوْبِ', '0', 'دعاء لبس الثوب');
//             ('3', 'دُعَـاءُ لُبْسِ الثَّوْبِ الجَــدِيدِ', '0', 'دعاء لبس الثوب الجديد');
//             ('4', 'الدُّعَاءُ لِمَنْ لَبِسَ ثـَوْباً جَـدِيداً', '0', 'الدعاء لمن لبس ثوبا جديدا');
//             ('5', 'مَا يَقُــولُ إِذَا وَضَــعَ ثـــَـوْبَهُ', '0', 'ما يقول إذا وضع ثوبه');
//             ('6', 'دُعَـاءُ دُخُـولِ الْخَــلاءِ', '0', 'دعاء دخول الخلاء');
//             ('7', 'دُعَاءُ الْخُـرُوجِ مِنَ الْخَـلاَءِ', '0', 'دعاء الخروج من الخلاء');
//             ('8', 'الذِّكْرُ قَبْـلَ الْوُضُـوءِ', '0', 'الذكر قبل الوضوء');
//             ('9', 'الذِّكْرُ بَعْدَ الْفَــرَاغِ مِنَ الْوُضُوءِ', '0', 'الذكر بعد الفراغ من الوضوء');
//             ('10', 'الذِّكْرُ عِنْدَ الْخُرُوجِ مِنَ الْمَنْزِلِ', '0', 'الذكر عند الخروج من المنزل');
//             ('11', 'الذِّكْرُ عِنْـدَ دُخُـولِ الـمَنْــزِلِ', '0', 'الذكر عند دخول المنزل');
//             ('12', 'دُعَــاءُ الذَّهَابِ إِلَى الْـمَسْــجِدِ', '0', 'دعاء الذهاب إلى المسجد');
//             ('13', 'دُعَاءُ دُخُولِ المَسْجِدِ', '0', 'دعاء دخول المسجد');
//             ('14', 'دُعَاءُ الْخُرُوجِ مِنَ الْـمَسْـجِدِ', '0', 'دعاء الخروج من المسجد');
//             ('15', 'أَذكَارُ الأَذَانِ', '0', 'أذكار الأذان');
//             ('16', 'دُعَـاءُ الاسْـتِفْتَاحِ', '0', 'دعاء الاستفتاح');
//             ('17', 'دُعَــاءُ الرُّكُــوعِ', '0', 'دعاء الركوع');
//             ('18', 'دُعَـاءُ الرَّفْــعِ مِنَ الرُّكُــوعِ', '0', 'دعاء الرفع من الركوع');
//             ('19', 'دُعَــاءُ السُّــجُودِ', '0', 'دعاء السجود');
//             ('20', 'دُعَــاءُ الْجلْسَةِ بَيْنَ السَّجْدَتَيْنِ', '0', 'دعاء الجلسة بين السجدتين');
//             ('21', 'دُعَــاءُ سُـجُودِ التِّـلاَوَةِ', '0', 'دعاء سجود التلاوة');
//             ('22', 'التَّشَـــهُّدُ', '0', 'التشهد');
//             ('23', 'الصَّلاةُ عَلَى النَّبيِّ صلى الله عليه وسلم بَعْدَ التَّشَهُّدِ', '0', 'الصلاة على النبي صلى الله عليه وسلم بعد التشهد');
//             ('24', 'الدُّعَاءُ بَعْدَ التَّشَهُّدِ الأَخِيرِ قَبْلَ السَّلاَمِ', '0', 'الدعاء بعد التشهد الأخير قبل السلام');
//             ('25', 'الأَذْكَارُ بَعْــدَ السَّــلاَمِ مِنَ الصَّــلاَةِ', '0', 'الأذكار بعد السلام من الصلاة');
//             ('26', 'دُعَــاءُ صَـلاَةِ الاسْتِــخَارَةِ', '0', 'دعاء صلاة الاستخارة');
//             ('27', 'أَذْكَارُ الصَّـبَاحِ ', '0', 'أذكار الصباح');
//             ('28', 'أَذْكَارُ الْمَسَــاءِ', '0', 'أذكار المساء');
//             ('29', 'أَذْكَارُ النَّــوْمِ', '0', 'أذكار النوم');
//             ('30', 'الدُّعَـاءُ إِذَا تَقَـلَّبَ لَيْــلاً', '0', 'الدعاء إذا تقلب ليلا');
//             ('31', 'دُعَاءُ الْفَزَعِ فِي النَّوْمِ وَمَنْ بُلِيَ بِالْوِحْشَةِ', '0', 'دعاء الفزع في النوم ومن بلي بالوحشة');
//             ('32', 'مَا يَفْعَلُ مَنْ رَأَى الرُّؤْيَا أَوِ الْحُلْمَ', '0', 'ما يفعل من رأى الرؤيا أو الحلم');
//             ('33', 'دُعَــاءُ قُنُـوتِ الْوِتْـرِ', '0', 'دعاء قنوت الوتر');
//             ('34', 'الذِّكْرُ عَقِــبَ السَّـلاَمِ مِنَ الْوِتْرِ', '0', 'الذكر عقب السلام من الوتر');
//             ('35', 'دُعَـــاءُ الْهَــمِّ وَالْحُــزْنِ', '0', 'دعاء الهم والحزن');
//             ('36', 'دُعَـاءُ الْكَـــرْبِ', '0', 'دعاء الكرب');
//             ('37', 'دُعَــاءُ لِقَاءِ الْعَدُوِّ وَذِي السُّــلْطَانِ', '0', 'دعاء لقاء العدو وذي السلطان');
//             ('38', 'دُعَـاءُ مَنْ خَافَ ظُلْمَ السُّـلْطَانِ', '0', 'دعاء من خاف ظلم السلطان');
//             ('39', 'الدُّعَــاءُ عَـلَى الْعَـــدُوِّ', '0', 'الدعاء على العدو');
//             ('40', 'مَــا يَقُـولُ مَـنْ خَــافَ قَوْماً', '0', 'ما يقول من خاف قوما');
//             ('41', 'دُعَاءُ مَنْ أَصَابَهُ وَسْوَسَةٌ فِي الإِيمَانِ', '0', 'دعاء من أصابه وسوسة في الإيمان');
//             ('42', 'دُعَــاءُ قَضَــاءِ الدَّيْــنِ', '0', 'دعاء قضاء الدين');
//             ('43', 'دُعَاءُ الوَسْوَسَةِ فِي الصَّلاَةِ وَالْقِرَاءَةِ', '0', 'دعاء الوسوسة في الصلاة والقراءة');
//             ('44', 'دُعَاءُ مَنِ اسْتَصْعَبَ عَلَيْهِ أَمْرٌ', '0', 'دعاء من استصعب عليه أمر');
//             ('45', 'مَا يَقُولُ وَيَفْعَلُ مَنْ أَذْنَبَ ذَنْباً', '0', 'ما يقول ويفعل من أذنب ذنبا');
//             ('46', 'دُعَاءُ طَرْدِ الشَّيطَانِ وَوَسَاوِسِهِ', '0', 'دعاء طرد الشيطان ووساوسه');
//             ('47', 'الدُّعَاءُ حِينَمَا يَقَعُ مَا لاَ يَرْضَاهُ أَوْ غُلِبَ عَلَى أَمْرِهِ', '0', 'الدعاء حينما يقع ما لا يرضاه أو غلب على أمره');
//             ('48', 'تَهْنِـئَةُ الـمَــوْلُودِ لَهُ وَجَوَابُهُ', '0', 'تهنئة المولود له وجوابه');
//             ('49', 'مَــا يُعــوَّذُ بِــهِ الأَوْلاَدُ', '0', 'ما يعوذ به الأولاد');
//             ('50', 'الدُّعَــاءُ لِلْمَـرِيضِ فِي عِيَادَتِهِ', '0', 'الدعاء للمريض في عيادته');
//             ('51', 'فَضْـلُ عِيَــادَةِ الـمَــرِيضِ', '0', 'فضل عيادة المريض');
//             ('52', 'دُعَاءُ المَرِيضِ الَّذِي يَئِسَ مِنْ حَيَاتِهِ', '0', 'دعاء المريض الذي يئس من حياته');
//             ('53', 'تَلْقِــينُ الـمُحْتــَضَرِ', '0', 'تلقين المحتضر');
//             ('54', 'دُعَــاءُ مَن أُصِيبَ بِمُصِيـبَةٍ', '0', 'دعاء من أصيب بمصيبة');
//             ('55', 'الدُّعَـاءُ عِنْــدَ إِغْمَــاضِ الـمَيِّــتِ', '0', 'الدعاء عند إغماض الميت');
//             ('56', 'الدُّعَـاءُ لِلمَيِّتِ فِي الصَّلاَةِ عَلَيْهِ', '0', 'الدعاء للميت في الصلاة عليه');
//             ('57', 'الدُّعَـاءُ لِلْفَرَطِ فِي الصَّلاَةِ عَلَيْهِ', '0', 'الدعاء للفرط في الصلاة عليه');
//             ('58', 'دُعَــاءُ التَّعْـزِيَةِ', '0', 'دعاء التعزية');
//             ('59', 'الدُّعَــاءُ عِنْدَ إِدْخَالِ الـميِّـتِ الْقَبْرَ', '0', 'الدعاء عند إدخال الميت القبر');
//             ('60', 'الدُّعَــاءُ بَعْـدَ دَفْنِ الـمَيِّــتِ', '0', 'الدعاء بعد دفن الميت');
//             ('61', 'دُعَـاءُ زِيَـارَةِ الْقُــبُورِ', '0', 'دعاء زيارة القبور');
//             ('62', 'دُعَــاءُ الرِّيــحِ', '0', 'دعاء الريح');
//             ('63', 'دُعَـاءُ الرَّعْـدِ', '0', 'دعاء الرعد');
//             ('64', 'مِــنْ أَدْعِيَـةِ الاسْــتِسْقَاءِ', '0', 'من أدعية الاستسقاء');
//             ('65', 'الــدُّعَاءُ إِذَا رَأَى الْـمَطَــرَ', '0', 'الدعاء إذا رأى المطر');
//             ('66', 'الذِّكْرُ بَعْـدَ نُزُولِ الْـمَطَــرِ', '0', 'الذكر بعد نزول المطر');
//             ('67', 'مِــنْ أَدْعِيَــةِ الاسْـتِصْحَاءِ', '0', 'من أدعية الاستصحاء');
//             ('68', 'دُعَــاءُ رُؤيَــةِ الهِــلاَلِ', '0', 'دعاء رؤية الهلال');
//             ('69', 'الدُّعَــاءُ عِنْدَ إِفْطَـارِ الصَّـائِمِ', '0', 'الدعاء عند إفطار الصائم');
//             ('70', 'الدُّعَــاءُ قَبْـلَ الطَّــعَامِ', '0', 'الدعاء قبل الطعام');
//             ('71', 'الدُّعَــاءُ عِنْدَ الْفَـرَاغِ مِنَ الطَّــعَامِ', '0', 'الدعاء عند الفراغ من الطعام');
//             ('72', 'دُعَــاءُ الضَّيْفِ لِصَـاحِبِ الطَّعَامِ', '0', 'دعاء الضيف لصاحب الطعام');
//             ('73', 'التَّعْرِيضُ بِالدُّعَاءُ لِطَلَبِ الطَّعَامِ أَوِ الشَّرَابِ', '0', 'التعريض بالدعاء لطلب الطعام أو الشراب');
//             ('74', 'الدُّعَــاءُ إِذَا أَفْطَرَ عِنْدَ أَهْــلِ بَيْتٍ', '0', 'الدعاء إذا أفطر عند أهل بيت');
//             ('75', 'دُعَاءُ الصَّائِمِ إِذَا حَضَرَ الطَّعَامُ وَلَمْ يُفْطِرْ', '0', 'دعاء الصائم إذا حضر الطعام ولم يفطر');
//             ('76', 'مَا يَقُولُ الصَّــائِمُ إِذَا سَــابَّهُ أَحَدٌ', '0', 'ما يقول الصائم إذا سابه أحد');
//             ('77', 'الدُّعَــاءُ عِنْــدَ رُؤْيَــةِ بَاكُورَةِ الثَّــمَرِ', '0', 'الدعاء عند رؤية باكورة الثمر');
//             ('78', 'دُعَـاءُ الْعُــطَاسِ', '0', 'دعاء العطاس');
//             ('79', 'مَا يُقَالُ لِلْكَافِرِ إِذَا عَطَسَ فَحَمِدَ اللهَ', '0', 'ما يقال للكافر إذا عطس فحمد الله');
//             ('80', 'الدُّعَــاءُ لِلْمُتَــزَوِّجِ', '0', 'الدعاء للمتزوج');
//             ('81', 'دُعَـاءُ الـمُــتَزَوِّجِ وَشِــرَاءِ الدَّابَّةِ', '0', 'دعاء المتزوج وشراء الدابة');
//             ('82', 'الدُّعَاءُ قَبْلَ إِتْيَانِ الزَّوْجَةِ', '0', 'الدعاء قبل إتيان الزوجة');
//             ('83', 'دُعَــاءُ الغَـضَبِ', '0', 'دعاء الغضب');
//             ('84', 'دُعَــاءُ مَنْ رَأَى مُبْتَلَىً', '0', 'دعاء من رأى مبتلى');
//             ('85', 'مَــا يُقَــالُ فِي المَجْلِسِ', '0', 'ما يقال في المجلس');
//             ('86', 'كَفَّــارَةُ الـمَــجْلِسِ', '0', 'كفارة المجلس');
//             ('87', 'الدُّعَـاءُ لِمَنْ قَالَ غَفَــرَ اللهُ لَكَ', '0', 'الدعاء لمن قال غفر الله لك');
//             ('88', 'الدُّعَاءُ لِمَنْ صَنَعَ إِلَيْكَ مَعْرُوفاً', '0', 'الدعاء لمن صنع إليك معروفا');
//             ('89', 'مَا يَعْصِمُ اللَّهُ بِهِ مِنَ الدَّجَّالِ', '0', 'ما يعصم الله به من الدجال');
//             ('90', 'الدُّعَاءُ لِمَنْ قَالَ إِنِّي أُحِبُّكَ فِي اللَّهِ', '0', 'الدعاء لمن قال إني أحبك في الله');
//             ('91', 'الدُّعَاءُ لِمَنْ عَرَضَ عَلَيْكَ مَالَهُ', '0', 'الدعاء لمن عرض عليك ماله');
//             ('92', 'الدُّعَاءُ لِمَنْ أَقْرَضَ عِنْدَ القَضَاءِ', '0', 'الدعاء لمن أقرض عند القضاء');
//             ('93', 'دُعَــاءُ الْخَــوْفِ مِــنَ الشِّــرْكِ', '0', 'دعاء الخوف من الشرك');
//             ('94', 'الدُّعَاءُ لِمَنْ قَالَ بَارَكَ اللَّهُ فِيكَ', '0', 'الدعاء لمن قال بارك الله فيك');
//             ('95', 'دُعَــاءُ كَرَاهِيَــةِ الطِّيـــَرَةِ', '0', 'دعاء كراهية الطيرة');
//             ('96', 'دُعَــاءُ الرُّكُـوبِ', '0', 'دعاء الركوب');
//             ('97', 'دُعَــاءُ السَّـفَرِ', '0', 'دعاء السفر');
//             ('98', 'دُعــاءُ دُخُـولِ القريَةِ أَوِ البَلْدَةِ', '0', 'دعاء دخول القرية أو البلدة');
//             ('99', 'دُعـاءُ دُخُـولِ السُّـوقِ', '0', 'دعاء دخول السوق');
//             ('100', 'الدُّعَــاءُ إِذَا تَعِــسَ الـمَــرْكُوبُ', '0', 'الدعاء إذا تعس المركوب');
//             ('101', 'دُعَــاءُ الـمُسَـافِرِ لِلْمُقــيمِ', '0', 'دعاء المسافر للمقيم');
//             ('102', 'دُعَـاءُ الـمُقِـيمِ لِلْمُسَـافِرِ', '0', 'دعاء المقيم للمسافر');
//             ('103', 'التَّكبيرُ والتَّسبِيحُ في سَيْرِ السَّفَرِ', '0', 'التكبير والتسبيح في سير السفر');
//             ('104', 'دُعاءُ الـمُسَـافِرِ إِذَا أَسْحَــرَ', '0', 'دعاء المسافر إذا أسحر');
//             ('105', 'الدُّعَاءُ إِذَا نَزَلَ مَنْزِلاً فِي سَفَرٍ أَوْ غَيْرِهِ', '0', 'الدعاء إذا نزل منزلا في سفر أو غيره');
//             ('106', 'ذِكْــرُ الرُّجُـوعِ مِــنَ السَّــفَرِ', '0', 'ذكر الرجوع من السفر');
//             ('107', 'مَا يَقُولُ مَنْ أَتَاهُ أَمْرٌ يَسُرُّهُ أَوْ يَكْرَهُهُ', '0', 'ما يقول من أتاه أمر يسره أو يكرهه');
//             ('108', 'فَضْــلُ الصَّــلاَةِ عَــلَى النَّبيِّ صلى الله عليه وسلم', '0', 'فضل الصلاة على النبي صلى الله عليه وسلم');
//             ('109', 'إِفْشَـاءُ السَّـلاَمِ', '0', 'إفشاء السلام');
//             ('110', 'ـ  كَيْفَ يَرُدُّ السَّلاَمَ عَلَى الْكَافِرِ إِذَا سَلَّمَ', '0', 'كيف يرد السلام على الكافر إذا سلم');
//             ('111', 'الدُّعاءُ عِنْدَ سَمَاعِ صِياحِ الدِّيكِ ونَهِيقِ الْحِمَارِ', '0', 'الدعاء عند سماع صياح الديك ونهيق الحمار');
//             ('112', 'الدُّعَاءُ عِنْدَ سَمَاعِ نُبَاحِ الْكِلاَبِ بِاللَّيْلِ', '0', 'الدعاء عند سماع نباح الكلاب بالليل');
//             ('113', 'الدُّعَــاءُ لِمَــنْ سَـبَبْتَهُ', '0', 'الدعاء لمن سببته');
//             ('114', 'مَا يَقُولُ المُسْلِمُ إِذَا مَدَحَ المُسْلِمَ', '0', 'ما يقول المسلم إذا مدح المسلم');
//             ('115', 'مَــا يَقُـولُ الـمُسْــلِمُ إِذَا زُكِّيَ', '0', 'ما يقول المسلم إذا زكي');
//             ('116', 'ـ  كَيْفَ يُلَبِّي المُحْرِمُ فِي الْحَجِّ أَوِ الْعُمْرَةِ', '0', 'كيف يلبي المحرم في الحج أو العمرة');
//             ('117', 'التَّكْبــِيرُ إِذَا أَتَى الْحَجَرَ الأَسْوَدَ', '0', 'التكبير إذا أتى الحجر الأسود');
//             ('118', 'الدُّعَاءُ بَيْنَ الرُّكْنِ الْيَمَانِيِّ وَالْحَجَرِ الأَسْوَدِ', '0', 'الدعاء بين الركن اليماني والحجر الأسود');
//             ('119', 'دُعَاءُ الْوُقُوفِ عَلَى الصَّفَا وَالمَرْوَةِ', '0', 'دعاء الوقوف على الصفا والمروة');
//             ('120', 'الدُّعَـاءُ يَــوْمَ عَـرَفَةَ', '0', 'الدعاء يوم عرفة');
//             ('121', 'الذِّكْـرُ عِنْــدَ الـمَشْـعَرِ الْحَرَامِ', '0', 'الذكر عند المشعر الحرام');
//             ('122', 'التَّكْبِيرُ عِنْدَ رَمْي ِ الْجِمَارِ مَعَ كُلِّ حَصَاةٍ', '0', 'التكبير عند رمي  الجمار مع كل حصاة');
//             ('123', 'دُعَاءُ التَّعَــجُّبِ وَالأَمْرِ السَّــارِّ', '0', 'دعاء التعجب والأمر السار');
//             ('124', 'مَا يَفْـعَلُ مَنْ أَتَاهُ أَمْرٌ يَسُـرُّهُ', '0', 'ما يفعل من أتاه أمر يسره');
//             ('125', 'مَا يَفْعَلُ وَيَقُولُ مَنْ أَحَسَّ وَجَعاً فِي جَسَدِهِ', '0', 'ما يفعل ويقول من أحس وجعا في جسده');
//             ('126', 'دُعَاءُ مَنْ خَشِيَ أَنْ يُصِيبَ شَيْئاً بِعَيْنِهِ', '0', 'دعاء من خشي أن يصيب شيئا بعينه');
//             ('127', 'مَا يُقَـالُ عِنْــدَ الْفَــزَعِ', '0', 'ما يقال عند الفزع');
//             ('128', 'مَا يَقُولُ عِنْدَ الذَّبْحِ أَوِ النَّحْرِ', '0', 'ما يقول عند الذبح أو النحر');
//             ('129', 'مَا يَقُولُ لِرَدِّ كَيْدِ مَرَدَةِ الشَّيَاطِينِ', '0', 'ما يقول لرد كيد مردة الشياطين');
//             ('130', 'الاسـتِغْفَارُ والتَّـوبَةُ', '0', 'الاستغفار والتوبة');
//             ('131', 'فَضْلُ التَّسْبِيحِ وَالتَّحْمِيدِ، وَالتَّهْلِيلِ، وَالتَّكْبِيرِ', '0', 'فضل التسبيح والتحميد، والتهليل، والتكبير');
//             ('132', 'كَيْفَ كَانَ النَّبيُّ صلى الله عليه وسلم يُسَبِّحُ؟', '0', 'كيف كان النبي صلى الله عليه وسلم يسبح؟');
//             ('133', 'مِنْ أَنْوَاعِ الْخَيْرِ وَالآدَابِ الْجَامِعَةِ', '0', 'من أنواع الخير والآداب الجامعة');*/
//}
//
